// Copyright (C) 1991 - 1999 Rational Software Corporation
//////////////////////////////////////////////////////////////////////////
#if defined (_MSC_VER) && (_MSC_VER >= 1000)
#pragma once
#endif
#ifndef _INC_TEXT_46F50C7401C5_INCLUDED
#define _INC_TEXT_46F50C7401C5_INCLUDED
//////////////////////////////////////////////////////////////////////////
#include <string>

#include "Shape.h"
//////////////////////////////////////////////////////////////////////////
class ostream;
//////////////////////////////////////////////////////////////////////////
//текст
//##ModelId=46F50C7401C5
class Text 
: public virtual Shape
{
protected:
    /************************************************************************/
    /* атрибуты                                                             */
    /************************************************************************/
    //содержимое текста
    //##ModelId=46F510A50251
    std::string _content;
public:
    /************************************************************************/
    /* конструкторы и деструктор                                            */
    /************************************************************************/
    //##ModelId=471220F702FD
    Text();

	//##ModelId=472DF1EC01B5
    Text(std::string text);

	//##ModelId=46F676990213
	virtual ~Text();

    /************************************************************************/
    /* геттеры/сеттеры                                                      */
    /************************************************************************/
	//##ModelId=46F510F20232
    std::string getText() const;

	//##ModelId=46F511550280
    void setText(std::string text);

    //вычисляет площадь фигуры
    //##ModelId=472DF2970261
    virtual float Area() const;

    /************************************************************************/
    /* прочие методы                                                        */
    /************************************************************************/    
    //##ModelId=472DDB2602DE
    virtual bool operator==(const Text& rhs) const;
protected:
    //имя класса
    //##ModelId=472DFDFD0128
    virtual int getName();

    //вывести состояние прямоугольника в поток
    //##ModelId=471218CE00DA
    virtual ostream& speak(ostream& os) const;
};
//////////////////////////////////////////////////////////////////////////
#endif /* _INC_TEXT_46F50C7401C5_INCLUDED */
