// Copyright (C) 1991 - 1999 Rational Software Corporation

#if defined (_MSC_VER) && (_MSC_VER >= 1000)
#pragma once
#endif
#ifndef _INC_SHAPE_46F50BDC00BB_INCLUDED
#define _INC_SHAPE_46F50BDC00BB_INCLUDED
//////////////////////////////////////////////////////////////////////////
class ostream;
//////////////////////////////////////////////////////////////////////////
//##ModelId=472E052302FD
enum SHAPES{
    SHAPE, RECTANGLE, OVAL, TEXT, TEXT_IN_OVAL
};
//////////////////////////////////////////////////////////////////////////
//обобщенная фигура
//##ModelId=46F50BDC00BB
class Shape 
{
protected:
    /************************************************************************/
    /* атрибуты                                                             */
    /************************************************************************/
    //абсцисса фигуры. все фигуры по умолчанию появляются в начале координат
    //##ModelId=46F50D19006D
    float _x;
    
    //ордината фигуры. все фигуры по умолчанию появляются в начале координат
    //##ModelId=46F50D1D00AB
	float _y;

public:
    /************************************************************************/
    /* конструкторы и деструктор                                            */
    /************************************************************************/
    //##ModelId=4708DDC303C8
    Shape();
    
    //##ModelId=4708DDC4001F
    virtual ~Shape();

    /************************************************************************/
    /* геттеры/сеттеры                                                      */
    /************************************************************************/
    //получить ординату фигуры
    //##ModelId=46F675DE02AF
    const float get__y() const;
    
    //задать ординату фигуры
    //##ModelId=46F675DF010B
    void set__y(float value);
    
    //получить абсциссу фигуры
    //##ModelId=46F675E401C7
    const float get__x() const;
    
    //задать абциссу фигуры
    //##ModelId=46F675E403AB
	void set__x(float value);

    /************************************************************************/
    /* операторы                                                            */
    /************************************************************************/
    //оператор вывода в поток
    //##ModelId=46F6755D0025
	friend ostream& operator<<(ostream& o, const Shape& rhs);

    //##ModelId=472DDB08029F
    virtual bool operator==(const Shape& rhs) const;
    /************************************************************************/
    /* прочие методы                                                        */
    /************************************************************************/    
	//перенести фигуру в заданную точку
	//##ModelId=46F50D80038A
	void moveToPoint(float x_pos, float y_pos);

    //вычисляет площадь фигуры
    //##ModelId=472DF22D0000
    virtual float Area() const = 0;
protected:
    //возвращает идентификатор класса из перечисления SHAPES
    //##ModelId=472DFDC300EA
    virtual int getName() const;

    //вывести состояние фигуры в поток
    //##ModelId=4712170B0271
    virtual ostream& speak(ostream& os) const;
};
//////////////////////////////////////////////////////////////////////////
#endif /* _INC_SHAPE_46F50BDC00BB_INCLUDED */
