// **************************************************************************
//! \file   MainPlayer.cpp
//! \brief  Класс реализующий игрока организатора
//! \author Bessonov A.V.
//! \date   17.May.2008 - 17.May.2008
// **************************************************************************

#include "stdafx.h"
#include "MainPlayer.h"

// ==========================================================================
namespace Game 
{
bool MainPlayer::ifMain () const
{
	return true;
}
}//end of namespace Game
// ==========================================================================
