// **************************************************************************
//! \file   SlavePlayer.h
//! \brief  Класс реализующий ведомого игрока
//! \author Bessonov A.V.
//! \date   17.May.2008 - 17.May.2008
// **************************************************************************

#include "stdafx.h"
#include "SlavePlayer.h"

// ==========================================================================
namespace Game 
{

bool SlavePlayer::ifMain () const
{
	return false;
}
}//end of namespace Game
// ==========================================================================
