// Copyright (C) 1991 - 1999 Rational Software Corporation

#if defined (_MSC_VER) && (_MSC_VER >= 1000)
#pragma once
#endif
#ifndef _INC_OVAL_46F50C54004E_INCLUDED
#define _INC_OVAL_46F50C54004E_INCLUDED
//////////////////////////////////////////////////////////////////////////
#include "Shape.h"
//////////////////////////////////////////////////////////////////////////
class ostream;
//овал
//##ModelId=46F50C54004E
class Oval 
: public virtual Shape
{
protected:
    /************************************************************************/
    /* атрибуты                                                             */
    /************************************************************************/
	//больший радиус овала
	//##ModelId=46F5136F00BB
	float _rad1;
    //меньший радиус овала
    //##ModelId=46F5139C0138
	float _rad2;
public:
    /************************************************************************/
    /* конструкторы и деструктор                                            */
    /************************************************************************/
    //##ModelId=4713C61F0203
    Oval(float rad1, float rad2);

    //##ModelId=46F674D6002E
	virtual ~Oval();

    /************************************************************************/
    /* геттеры/сеттеры                                                      */
    /************************************************************************/
	//получить больший радиус
	//##ModelId=46F67B2D004E
	const float getRad1() const;

	//задать больший радиус
	//##ModelId=46F67B2D0244
	void setRad1(float value);

	//получить меньший радиус
	//##ModelId=46F67B2F0263
	const float getRad2() const;

	//задать меньший радиус
	//##ModelId=46F67B30008E
	void setRad2(float value);

    /************************************************************************/
    /* прочие методы                                                        */
    /************************************************************************/    
    //##ModelId=472DDB2002EE
    bool operator==(const Oval& rhs) const;
protected:
    //вывести состояние овала в поток
    //##ModelId=471218B200EA
    virtual ostream& speak(ostream& os) const;
};
//////////////////////////////////////////////////////////////////////////
#endif /* _INC_OVAL_46F50C54004E_INCLUDED */
