// Copyright (C) 1991 - 1999 Rational Software Corporation
//////////////////////////////////////////////////////////////////////////
#if defined (_MSC_VER) && (_MSC_VER >= 1000)
#pragma once
#endif
#ifndef _INC_TEXT_46F50C7401C5_INCLUDED
#define _INC_TEXT_46F50C7401C5_INCLUDED
//////////////////////////////////////////////////////////////////////////
#include "Shape.h"
//////////////////////////////////////////////////////////////////////////
class ostream;
//////////////////////////////////////////////////////////////////////////
//текст
//##ModelId=46F50C7401C5
class Text 
: public virtual Shape
{
protected:
    /************************************************************************/
    /* атрибуты                                                             */
    /************************************************************************/
    //содержимое текста
    //##ModelId=46F510A50251
    char* _content;
public:
    /************************************************************************/
    /* конструкторы и деструктор                                            */
    /************************************************************************/
    //##ModelId=471220F702FD
    Text();

	//##ModelId=46F676990213
	virtual ~Text();

    /************************************************************************/
    /* геттеры/сеттеры                                                      */
    /************************************************************************/
	//##ModelId=46F510F20232
    char* getText() const;

	//##ModelId=46F511550280
    void setText(char* text);

    /************************************************************************/
    /* прочие методы                                                        */
    /************************************************************************/    
	//добавить новый текст к старому
	//##ModelId=46F5119901A5
    void appendText(char* text);

protected:
    //вывести состояние прямоугольника в поток
    //##ModelId=471218CE00DA
    virtual ostream& speak(ostream& os) const;
};
//////////////////////////////////////////////////////////////////////////
#endif /* _INC_TEXT_46F50C7401C5_INCLUDED */





















